; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image1 - mode
	infrared0 - mode
	thermograph2 - mode
	Star6 - direction
	Star14 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star10 - direction
	Star4 - direction
	Star11 - direction
	Star0 - direction
	GroundStation8 - direction
	GroundStation12 - direction
	Star7 - direction
	GroundStation3 - direction
	Star13 - direction
	Star5 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Star24 - direction
	Planet25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Phenomenon28 - direction
	Star29 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star13)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument3 image1)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star7)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation9)
)
(:goal (and
	(pointing satellite1 Phenomenon27)
	(pointing satellite2 Star10)
	(pointing satellite3 Planet15)
	(have_image Planet15 infrared0)
	(have_image Star16 image1)
	(have_image Star17 image1)
	(have_image Phenomenon18 infrared0)
	(have_image Planet19 thermograph2)
	(have_image Planet20 thermograph2)
	(have_image Star21 thermograph2)
	(have_image Phenomenon22 image1)
	(have_image Planet23 image1)
	(have_image Star24 infrared0)
	(have_image Planet25 image1)
	(have_image Planet26 thermograph2)
	(have_image Phenomenon27 infrared0)
	(have_image Phenomenon28 image1)
	(have_image Star29 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation3 groundstation9)
   deleted: (pointing satellite3 groundstation9)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 18
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 18
3. (calibrate satellite3 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 0 of 18
4. (turn_to satellite3 planet19 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet19)
   goals met: 0 of 18
5. (take_image satellite3 planet19 instrument6 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 1 of 18
6. (turn_to satellite3 phenomenon28 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 phenomenon28)
   goals met: 1 of 18
7. (take_image satellite3 phenomenon28 instrument6 image1)
   added: (have_image phenomenon28 image1)
   goals met: 2 of 18
8. (turn_to satellite3 phenomenon27 phenomenon28)
   deleted: (pointing satellite3 phenomenon28)
   added: (pointing satellite3 phenomenon27)
   goals met: 2 of 18
9. (take_image satellite3 phenomenon27 instrument6 infrared0)
   added: (have_image phenomenon27 infrared0)
   goals met: 3 of 18
10. (turn_to satellite3 phenomenon22 phenomenon27)
   deleted: (pointing satellite3 phenomenon27)
   added: (pointing satellite3 phenomenon22)
   goals met: 3 of 18
11. (take_image satellite3 phenomenon22 instrument6 image1)
   added: (have_image phenomenon22 image1)
   goals met: 4 of 18
12. (turn_to satellite3 phenomenon18 phenomenon22)
   deleted: (pointing satellite3 phenomenon22)
   added: (pointing satellite3 phenomenon18)
   goals met: 4 of 18
13. (turn_to satellite2 star10 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star10)
   goals met: 5 of 18
14. (turn_to satellite1 phenomenon27 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon27)
   goals met: 6 of 18
15. (take_image satellite3 phenomenon18 instrument6 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 7 of 18
16. (turn_to satellite3 planet20 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet20)
   goals met: 7 of 18
17. (take_image satellite3 planet20 instrument6 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 8 of 18
18. (turn_to satellite3 planet23 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet23)
   goals met: 8 of 18
19. (take_image satellite3 planet23 instrument6 image1)
   added: (have_image planet23 image1)
   goals met: 9 of 18
20. (turn_to satellite3 planet25 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet25)
   goals met: 9 of 18
21. (take_image satellite3 planet25 instrument6 image1)
   added: (have_image planet25 image1)
   goals met: 10 of 18
22. (turn_to satellite3 planet26 planet25)
   deleted: (pointing satellite3 planet25)
   added: (pointing satellite3 planet26)
   goals met: 10 of 18
23. (take_image satellite3 planet26 instrument6 thermograph2)
   added: (have_image planet26 thermograph2)
   goals met: 11 of 18
24. (turn_to satellite3 star16 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 star16)
   goals met: 11 of 18
25. (take_image satellite3 star16 instrument6 image1)
   added: (have_image star16 image1)
   goals met: 12 of 18
26. (turn_to satellite3 star17 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star17)
   goals met: 12 of 18
27. (take_image satellite3 star17 instrument6 image1)
   added: (have_image star17 image1)
   goals met: 13 of 18
28. (turn_to satellite3 star21 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 star21)
   goals met: 13 of 18
29. (take_image satellite3 star21 instrument6 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 14 of 18
30. (turn_to satellite3 star24 star21)
   deleted: (pointing satellite3 star21)
   added: (pointing satellite3 star24)
   goals met: 14 of 18
31. (take_image satellite3 star24 instrument6 infrared0)
   added: (have_image star24 infrared0)
   goals met: 15 of 18
32. (turn_to satellite3 star29 star24)
   deleted: (pointing satellite3 star24)
   added: (pointing satellite3 star29)
   goals met: 15 of 18
33. (take_image satellite3 star29 instrument6 thermograph2)
   added: (have_image star29 thermograph2)
   goals met: 16 of 18
34. (turn_to satellite3 planet15 star29)
   deleted: (pointing satellite3 star29)
   added: (pointing satellite3 planet15)
   goals met: 17 of 18
35. (take_image satellite3 planet15 instrument6 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 18 of 18
